[4.2.3 - Log Retention]
action.email.useNSSubject = 1
alert.track = 0
auto_summarize = 1
auto_summarize.dispatch.earliest_time = -1y@d
description = Logs are retained for a sufficient period, managed securely, reviewed regularly and can be searched to identify malicious activity.
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = index=* |fields _time, index, sourcetype | stats count earliest(_time) as "EarliestEvent" latest(_time) as "LatestEvent" by sourcetype, index | eval Retention=LatestEvent-EarliestEvent, RetentionInDays=round(Retention/60/60/24,1) | stats list(sourcetype) as SourceType, list(count) as "Event Count", list(RetentionInDays) as "Retention in Days" by index

[4.2.4 - Dormant Accounts]
action.email.useNSSubject = 1
alert.track = 0
description = Former employees', guest and other unnecessary accounts are routinely and promptly removed or disabled from internal workstations, Active Directory domains and other user directories.  Privileged user access is also removed when no longer required or appropriate.
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.statistics.format.0 = number
display.statistics.format.0.field = days_ago
display.statistics.format.0.precision = 0
display.statistics.format.0.unit = days
display.statistics.format.1 = number
display.statistics.format.1.field = Last Logon
display.statistics.format.1.precision = 0
display.statistics.format.1.unit = days
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats summariesonly=true allow_old_summaries=true latest(_time) as last_login from datamodel=Authentication.Authentication where Authentication.action=* by Authentication.user | rename "Authentication.*" as "*" | eval days_ago=(now()-last_login)/3600/24 | sort - days_ago | where days_ago > 30 | fields - last_login | rename days_ago as "Last Logon"

[4.5.2 - Account Lockouts]
action.email.useNSSubject = 1
alert.track = 0
description = Technical controls enforce password policy and mitigate against password-guessing attacks.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = `wineventlog-index` EventCode=4740 | stats values(host) as Host values(EventCode) as "Windows Event Code" values(signature) as "Event Description", count by user

[4.2.4 - Default Account Use]
action.email.useNSSubject = 1
alert.track = 0
description = Former employees', guest and other unnecessary accounts are routinely and promptly removed or disabled from internal workstations, Active Directory domains and other user directories.  Privileged user access is also removed when no longer required or appropriate.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats summariesonly=true allow_old_summaries=true count from datamodel=Authentication.Authentication where Authentication.action=* by Authentication.user, Authentication.action | search Authentication.user IN (admin,administrator,sa,guest,root,mysql-root) | rename Authentication.* as *

[6.2.1, 6.2.3 - Hosts with AntiVirus]
action.email.useNSSubject = 1
alert.track = 0
description = Has antivirus/anti-malware software been installed on all computers that are connected to or capable of connecting to the Internet? And is it kept continually up to date?
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | from datamodel:"Malware"."Malware_Operations"| search product_version=* | stats latest(signature_version) as "Virus Signature Pack" latest(product_version) as "AV Product Version" by dest | rename dest as Host

[9.6.5 - Triggered Firewall Rules]
action.email.useNSSubject = 1
alert.track = 0
description = Have firewall rules that are no longer required been removed or disabled?
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats summariesonly=true allow_old_summaries=true count as triggered from datamodel=Network_Traffic.All_Traffic by All_Traffic.rule\
| rename "All_Traffic.*" as "*"

[9.5.3 - Firewall Change Monitoring]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | from datamodel:"Change"."Network_Changes" | table _time user command status src dest vendor_product

[6.2.5 - Blocked Connections to Malicious Websites]
action.email.useNSSubject = 1
alert.track = 0
description = Connections to malicious websites on the Internet are prevented.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats local=false summariesonly=true allow_old_summaries=true count from datamodel=Intrusion_Detection.IDS_Attacks where IDS_Attacks.severity="*" IDS_Attacks.action!=allowed by IDS_Attacks.dest, IDS_Attacks.signature  | rename "IDS_Attacks.*" as "*" | search dest!=10.*.*.* dest!=192.168.*.*

[9.6.3 - Blocked Inbound Connections]
action.email.useNSSubject = 1
alert.track = 0
description = The organisation has checked and verified that firewall rules ensure that all unauthenticated inbound connections are blocked by default.
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats summariesonly=true allow_old_summaries=true count from datamodel=Network_Traffic.All_Traffic where (All_Traffic.action=blocked OR All_Traffic.action=dropped) by All_Traffic.dest_ip | rename All_Traffic.* as * | search dest_ip!=10.*.*.* dest_ip!=192.168.*.*

[8.3.7 - OS Versions]
action.email.useNSSubject = 1
alert.track = 0
description = Are 95% of your server estate and 98% of your desktop estate on supported versions of operating systems?
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = eventtype="hostmon_windows" (Type=Computer OR Type=OperatingSystem) \
| stats latest(OS) as OS, latest(Domain) as Domain, latest(Architecture) as Architecture by host \
| table host Archotecture OS
workload_pool = undefined

[9.5.8 - Remote Authentication]
action.email.useNSSubject = 1
alert.track = 0
description = All remote access is authenticated.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = splunk_app_for_dspt_compliance
request.ui_dispatch_view = search
search = | tstats summariesonly=true allow_old_summaries=true count from datamodel=Network_Sessions.All_Sessions where nodename=All_Sessions.VPN All_Sessions.user=* by All_sessions.action, All_sessions.user
workload_pool = undefined
